source /home/synopsys/pts/O-2018.06-SP1/admin/setup/.synopsys_pt.setup
lappend search_path /home/ICer/Baraka/PIT/rtl
lappend search_path /home/ICer/saed32nm_lib/ref/DBs
lappend search_path /home/ICer/Baraka/PIT/syn
set SSTF "saed32hvt_ss0p75v125c.db"
set FFTF "saed32lvt_ff1p16vn40c.db"
set link_library   [list * $SSTF $FFTF]
set target_library [list   $SSTF $FFTF]
set netlist_file "/home/ICer/Baraka/PIT/pnr/netlist.v"
set parasitics_file "/home/ICer/Baraka/PIT/pnr/para.tlup_max_125.spef"
set constraints_file "/home/ICer/Baraka/PIT/pnr/pnr.sdc"
set report_default_significant_digits 3 ;
read_verilog $netlist_file
current_design pit_top
link
read_parasitics $parasitics_file
source -echo $constraints_file
set timing_save_pin_arrival_and_slack true
set power_enable_analysis true
set power_enable_em_analysis true
set si_enable_analysis true
update_timing
update_power
update_noise
save_indesign_session /tmp/.gca_2xqMsW 
fix_eco_timing -type setup -cell_type combinational -buffer_list {INVX1_LVT INVX2_LVT INVX4_LVT INVX1_HVT INVX2_HVT INVX4_HVT} -methods size_cell
fix_eco_timing -type hold  -cell_type combinational -buffer_list {INVX1_LVT INVX2_LVT INVX4_LVT INVX1_HVT INVX2_HVT INVX4_HVT} -methods insert_inverter_pair
write_changes -format icc2tcl -output write_changes.tcl
save_indesign_session /tmp/.gca_HyXikX 
